tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "rcmdnk/file"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Load/unload environment variables based on $PWD
brew "direnv"
# Read-only implementation of ext4 for FUSE
brew "ext4fuse"
# Simple, fast and user-friendly alternative to find
brew "fd"
# XML-based font configuration API for X Windows
brew "fontconfig"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Command-line fuzzy finder written in Go
brew "fzf"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Improved top (interactive process viewer)
brew "htop"
# Configurable static site generator
brew "hugo"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Terminal file manager
brew "lf"
# Powerful, lightweight programming language
brew "lua"
# Mac App Store command-line interface
brew "mas"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Network grep
brew "ngrep"
# Tiny, lightning fast, feature-packed file manager
brew "nnn", link: false
# Platform built on V8 to build network applications
brew "node"
# Platform built on V8 to build network applications
brew "node@18"
# Command-line tools for MySQL, MariaDB and system tasks
brew "percona-toolkit"
# Pretty system information tool written in POSIX sh
brew "pfetch"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# File browser
brew "ranger"
# Rsync for cloud storage
brew "rclone"
# Tool to build, change, and version infrastructure
brew "terraform"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Simple terminal image viewer written in Rust
brew "viu"
# Generator for LS_COLORS with support for multiple color themes
brew "vivid"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Brewfile manager for Homebrew.
brew "rcmdnk/file/brew-file"
# Automated testing of webapps for Google Chrome
cask "chromedriver"
# GPU-based terminal emulator
cask "kitty"
# Clipboard manager
cask "maccy"
# File system integration
cask "macfuse"
# Multimedia player
cask "vlc"
# Rust-based terminal
cask "warp"
mas "AdGuard for Safari", id: 1440147259
mas "Connective Plugin", id: 1428740565
mas "eidReader", id: 1190651975
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Microsoft Excel", id: 462058435
mas "Microsoft Outlook", id: 985367838
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Remote Desktop", id: 1295203466
mas "Microsoft Word", id: 462054704
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "The Unarchiver", id: 425424353
mas "Vimari", id: 1480933944
mas "WeChat", id: 836500024
