tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "rcmdnk/file"
brew "gls"
brew "pkg-config"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Load/unload environment variables based on $PWD
brew "direnv"
# Read-only implementation of ext4 for FUSE
brew "ext4fuse"
# Simple, fast and user-friendly alternative to find
brew "fd"
# XML-based font configuration API for X Windows
brew "fontconfig"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Command-line fuzzy finder written in Go
brew "fzf"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Improved top (interactive process viewer)
brew "htop"
# Configurable static site generator
brew "hugo"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Terminal file manager
brew "lf"
# Powerful, lightweight programming language
brew "lua"
# Mac App Store command-line interface
brew "mas"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Network grep
brew "ngrep"
# Tiny, lightning fast, feature-packed file manager
brew "nnn", link: false
# Platform built on V8 to build network applications
brew "node"
# Command-line tools for MySQL, MariaDB and system tasks
brew "percona-toolkit"
# Pretty system information tool written in POSIX sh
brew "pfetch"
# File browser
brew "ranger"
# Rsync for cloud storage
brew "rclone"
# Tool to build, change, and version infrastructure
brew "terraform"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Simple terminal image viewer written in Rust
brew "viu"
# Generator for LS_COLORS with support for multiple color themes
brew "vivid"
brew "zsh"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Brewfile manager for Homebrew.
brew "rcmdnk/file/brew-file"
# Clipboard manager
cask "maccy"
# File system integration
cask "macfuse"
# Multimedia player
cask "vlc"
